# GetSlabPreferencesStyle

## Description
Gets the Slab Style of the Slab Preferences.

```pascal
FUNCTION GetSlabPreferencesStyle : LONGINT;
```

```python
def vs.GetSlabPreferencesStyle():
    return LONGINT
```

## Examples
```pascal
resultN := GetSlabPreferencesStyle;
```
```python
import vs

# Gets the Slab Style of the Slab Preferences.
resultN = vs.GetSlabPreferencesStyle()
vs.Message('GetSlabPreferencesStyle returned: ' + str(resultN))
```

## See Also
VS Functions:
SetSlabPreferencesStyle

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural